; Требуется составить программу на языке ассемблера, которая обеспечит ввод
; матрицы, преобразование согласно индивидуальному заданию и вывод изменённой
; матрицы.
; В программе должна быть выделена память под матрицу 9х9. Фактический размер
; задаётся пользователем и не превышает 9х9.
; Матрицу считать статической (как если бы в Си она была объявлена char a[9][9]) и
; работать с ней соответствующим образом.
; Тип матрицы “символьная” означает, что элементом матрицы является один символ.
; Тип “цифровая” означает, что элементом является цифра.
; Для решения задачи можно вводить дополнительные переменные, в том числе
; массивы.

; Матрица: прямоугольная цифровая

; Задание: если значение какого-либо элемента не
; превышает количества элементов в строке,
; заменить его значением элемента, чей индекс в
; строке равен старому значению

EXTRN input: near
EXTRN replace: near
EXTRN output: near

PUBLIC MAX_N_M_VALUES
PUBLIC matrix
PUBLIC n
PUBLIC m

; Создание сегмента стека
StackSEG SEGMENT PARA STACK 'STACK'
    db 256 dup(0)
StackSEG ENDS

; Создание сегмента данных (констант)
DSEG SEGMENT PARA PUBLIC 'DATA'
MAX_N_M_VALUES db 9
DSEG ENDS

; Создание сегмента данных (для работы)
DSEG SEGMENT PARA PUBLIC 'DATA'
n db '$'
m db '$'
matrix db 9 dup(9 dup(0))
DSEG ENDS

; Создание сегмента кода
CSEG SEGMENT PARA PUBLIC 'CODE'
    assume DS:DSEG, CS:CSEG, SS:StackSEG
main:
    mov AX, DSEG
    mov DS, AX
    
    ; Ввод данных
    call input

    ; Изменение матрицы
    call replace

    ; Вывод результата
    call output
finish_program:
    mov AH, 4Ch
    int 21h
CSEG ENDS

END main